## :x: Apply Result





<pre><code>Error: POST https://api.github.com/repos/kyma-project/test-infra/actions/variables: 409 Already exists - Variable already exists []

  with github_actions_variable.gcp_terraform_executor_service_account_email,
  on terraform-executor.tf line 70, in resource &#34;github_actions_variable&#34; &#34;gcp_terraform_executor_service_account_email&#34;:
  70: resource &#34;github_actions_variable&#34; &#34;gcp_terraform_executor_service_account_email&#34; {


Error: Error creating WorkloadIdentityPool: googleapi: got HTTP response code 404 with body: &lt;!DOCTYPE html&gt;
&lt;html lang=en&gt;
  &lt;meta charset=utf-8&gt;
  &lt;meta name=viewport content=&#34;initial-scale=1, minimum-scale=1, width=device-width&#34;&gt;
  &lt;title&gt;Error 404 (Not Found)!!1&lt;/title&gt;
  &lt;style&gt;
    *{margin:0;padding:0}html,code{font:15px/22px arial,sans-serif}html{background:#fff;color:#222;padding:15px}body{margin:7% auto 0;max-width:390px;min-height:180px;padding:30px 0 15px}* &gt; body{background:url(//www.google.com/images/errors/robot.png) 100% 5px no-repeat;padding-right:205px}p{margin:11px 0 22px;overflow:hidden}ins{color:#777;text-decoration:none}a img{border:0}@media screen and (max-width:772px){body{background:none;margin-top:0;max-width:none;padding-right:0}}#logo{background:url(//www.google.com/images/branding/googlelogo/1x/googlelogo_color_150x54dp.png) no-repeat;margin-left:-5px}@media only screen and (min-resolution:192dpi){#logo{background:url(//www.google.com/images/branding/googlelogo/2x/googlelogo_color_150x54dp.png) no-repeat 0% 0%/100% 100%;-moz-border-image:url(//www.google.com/images/branding/googlelogo/2x/googlelogo_color_150x54dp.png) 0}}@media only screen and (-webkit-min-device-pixel-ratio:2){#logo{background:url(//www.google.com/images/branding/googlelogo/2x/googlelogo_color_150x54dp.png) no-repeat;-webkit-background-size:100% 100%}}#logo{display:inline-block;height:54px;width:150px}
  &lt;/style&gt;
  &lt;a href=//www.google.com/&gt;&lt;span id=logo aria-label=Google&gt;&lt;/span&gt;&lt;/a&gt;
  &lt;p&gt;&lt;b&gt;404.&lt;/b&gt; &lt;ins&gt;That’s an error.&lt;/ins&gt;
  &lt;p&gt;The requested URL &lt;code&gt;/v1beta/projects/projects/%22sap-kyma-prow%22/regions/%22europe-west4%22/zones/%3Cnull%3E/locations/global/workloadIdentityPools?alt=json&amp;amp;workloadIdentityPoolId=github-com-kyma-project-pool&lt;/code&gt; was not found on this server.  &lt;ins&gt;That’s all we know.&lt;/ins&gt;


  with module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool.main,
  on .terraform/modules/gh_com_kyma_project_workload_identity_federation/modules/gh-oidc/main.tf line 17, in resource &#34;google_iam_workload_identity_pool&#34; &#34;main&#34;:
  17: resource &#34;google_iam_workload_identity_pool&#34; &#34;main&#34; {
</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
google_service_account.sa_gke_kyma_integration: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com]
data.google_client_config.gcp: Reading...
data.google_container_cluster.untrusted_workload_k8s_cluster: Reading...
data.google_container_cluster.trusted_workload_k8s_cluster: Reading...
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
data.google_container_cluster.prow_k8s_cluster: Reading...
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
data.google_client_config.gcp: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
google_container_cluster.trusted_workload: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
data.google_container_cluster.prow_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west3-a/clusters/prow]
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Read complete after 0s [id=5e665b7758004bfcd801b09dd2fa7c23fcca9d46e860397abc2aac2e213deb16]
data.google_container_cluster.untrusted_workload_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west3/clusters/untrusted-workload-kyma-prow]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 0s [id=927f68fe2b1bee2bed9ddde896cce2ee56bbf0312119b6937b57278b94152090]
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Read complete after 0s [id=dd3443633a39325c8656d232ea51eb8515040007156fb9e6433fddd5276456b6]
data.google_container_cluster.trusted_workload_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/untrusted/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/workloads/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/untrusted/**.yaml"]: Read complete after 0s [id=e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/workloads/**.yaml"]: Read complete after 0s [id=39e17c189ee6046adcadc079637325fc9116c71f11706bfccc1279dc53df9efe]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 0s [id=927f68fe2b1bee2bed9ddde896cce2ee56bbf0312119b6937b57278b94152090]
module.untrusted_workload_gatekeeper.data.kubectl_file_documents.gatekeeper: Read complete after 0s [id=dd3443633a39325c8656d232ea51eb8515040007156fb9e6433fddd5276456b6]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspcapabilities\n  annotations:\n    metadata.gatekeeper.sh/title: \"Capabilities\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls Linux capabilities on containers. Corresponds to the\n      `allowedCapabilities` and `requiredDropCapabilities` fields in a\n      PodSecurityPolicy. For more information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#capabilities\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPCapabilities\n      validation:\n        # Schema for the `parameters` field\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls Linux capabilities on containers. Corresponds to the\n            `allowedCapabilities` and `requiredDropCapabilities` fields in a\n            PodSecurityPolicy. For more information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#capabilities\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n            allowedCapabilities:\n              type: array\n              description: \"A list of Linux capabilities that can be added to a container.\"\n              items:\n                type: string\n            requiredDropCapabilities:\n              type: array\n              description: \"A list of Linux capabilities that are required to be dropped from a container.\"\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package capabilities\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.containers[_]\n          not is_exempt(container)\n          has_disallowed_capabilities(container)\n          msg := sprintf(\"container <%v> has a disallowed capability. Allowed capabilities are %v\", [container.name, get_default(input.parameters, \"allowedCapabilities\", \"NONE\")])\n        }\n\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.containers[_]\n          not is_exempt(container)\n          missing_drop_capabilities(container)\n          msg := sprintf(\"container <%v> is not dropping all required capabilities. Container must drop all of %v or \\\"ALL\\\"\", [container.name, input.parameters.requiredDropCapabilities])\n        }\n\n\n\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.initContainers[_]\n          not is_exempt(container)\n          has_disallowed_capabilities(container)\n          msg := sprintf(\"init container <%v> has a disallowed capability. Allowed capabilities are %v\", [container.name, get_default(input.parameters, \"allowedCapabilities\", \"NONE\")])\n        }\n\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.initContainers[_]\n          not is_exempt(container)\n          missing_drop_capabilities(container)\n          msg := sprintf(\"init container <%v> is not dropping all required capabilities. Container must drop all of %v or \\\"ALL\\\"\", [container.name, input.parameters.requiredDropCapabilities])\n        }\n\n\n\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.ephemeralContainers[_]\n          not is_exempt(container)\n          has_disallowed_capabilities(container)\n          msg := sprintf(\"ephemeral container <%v> has a disallowed capability. Allowed capabilities are %v\", [container.name, get_default(input.parameters, \"allowedCapabilities\", \"NONE\")])\n        }\n\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.ephemeralContainers[_]\n          not is_exempt(container)\n          missing_drop_capabilities(container)\n          msg := sprintf(\"ephemeral container <%v> is not dropping all required capabilities. Container must drop all of %v or \\\"ALL\\\"\", [container.name, input.parameters.requiredDropCapabilities])\n        }\n\n\n        has_disallowed_capabilities(container) {\n          allowed := {c | c := lower(input.parameters.allowedCapabilities[_])}\n          not allowed[\"*\"]\n          capabilities := {c | c := lower(container.securityContext.capabilities.add[_])}\n\n          count(capabilities - allowed) > 0\n        }\n\n        missing_drop_capabilities(container) {\n          must_drop := {c | c := lower(input.parameters.requiredDropCapabilities[_])}\n          all := {\"all\"}\n          dropped := {c | c := lower(container.securityContext.capabilities.drop[_])}\n\n          count(must_drop - dropped) > 0\n          count(all - dropped) > 0\n        }\n\n        get_default(obj, param, _default) = out {\n          out = obj[param]\n        }\n\n        get_default(obj, param, _default) = out {\n          not obj[param]\n          not obj[param] == false\n          out = _default\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8spspcapabilities]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["# k8sallowedimages constraint template validates that a pod is not using an image that is not allowed.\n# It prevents the use of images with the :latest tag.\n# The k8sallowedimages accepts one parameter:\n# - images: a list of allowed image URLs. Each image URL must be a prefix of the image URL used in the Pod spec.\napiVersion: templates.gatekeeper.sh/v1beta1\nkind: ConstraintTemplate\nmetadata:\n  name: k8sallowedimages\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sAllowedImages\n      validation:\n        openAPIV3Schema:\n          properties:\n            images:\n              type: array\n              items:\n                type: string\n                description: A list of allowed image URLs. Each image URL must be a prefix of the image URL used in the Pod spec.\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8sallowedimages\n        # Check containers are not using latest tag.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.containers[_]\n          # Check if object is using an image with latest tag.\n          endswith(container.image, \":latest\")\n          msg := sprintf(\"container <%v> in namespace <%v> has image <%v> with latest tag, using latest tag is not allowed\", [container.name, input.review.object.metadata.namespace, container.image])\n        }\n\n        # Check init containers are not using latest tag.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.initContainers[_]\n          # Check if object is using an image with latest tag.\n          endswith(container.image, \":latest\")\n          msg := sprintf(\"container <%v> in namespace <%v> has image <%v> with latest tag, using latest tag is not allowed\", [container.name, input.review.object.metadata.namespace, container.image])\n        }\n        # Check containers are using allowed images.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.containers[_]\n          # Check object is using an image that is not allowed.\n          not strings.any_prefix_match(container.image, input.parameters.images)\n          msg := sprintf(\"container <%v> in namespace <%v> has an invalid image repo <%v>, allowed repos are %v\", [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])\n        }\n\n        # Check init containers are using allowed images.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.initContainers[_]\n          # Check object is using an image that is not allowed.\n          not strings.any_prefix_match(container.image, input.parameters.images)\n          msg := sprintf(\"container <%v> in namespace <%v> has an invalid image repo <%v>, allowed repos are %v\", [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])\n        }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1beta1/constrainttemplates/k8sallowedimages]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spsphostnetworkingports\n  annotations:\n    metadata.gatekeeper.sh/title: \"Host Networking Ports\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls usage of host network namespace by pod containers. Specific\n      ports must be specified. Corresponds to the `hostNetwork` and\n      `hostPorts` fields in a PodSecurityPolicy. For more information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#host-namespaces\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPHostNetworkingPorts\n      validation:\n        # Schema for the `parameters` field\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls usage of host network namespace by pod containers. Specific\n            ports must be specified. Corresponds to the `hostNetwork` and\n            `hostPorts` fields in a PodSecurityPolicy. For more information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#host-namespaces\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n            hostNetwork:\n              description: \"Determines if the policy allows the use of HostNetwork in the pod spec.\"\n              type: boolean\n            min:\n              description: \"The start of the allowed port range, inclusive.\"\n              type: integer\n            max:\n              description: \"The end of the allowed port range, inclusive.\"\n              type: integer\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spsphostnetworkingports\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            input_share_hostnetwork(input.review.object)\n            msg := sprintf(\"The specified hostNetwork and hostPort are not allowed, pod: %v. Allowed values: %v\", [input.review.object.metadata.name, input.parameters])\n        }\n\n        input_share_hostnetwork(o) {\n            not input.parameters.hostNetwork\n            o.spec.hostNetwork\n        }\n\n        input_share_hostnetwork(o) {\n            hostPort := input_containers[_].ports[_].hostPort\n            hostPort < input.parameters.min\n        }\n\n        input_share_hostnetwork(o) {\n            hostPort := input_containers[_].ports[_].hostPort\n            hostPort > input.parameters.max\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n            not is_exempt(c)\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n            not is_exempt(c)\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n            not is_exempt(c)\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8spsphostnetworkingports]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spsphostfilesystem\n  annotations:\n    metadata.gatekeeper.sh/title: \"Host Filesystem\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls usage of the host filesystem. Corresponds to the\n      `allowedHostPaths` field in a PodSecurityPolicy. For more information,\n      see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#volumes-and-file-systems\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPHostFilesystem\n      validation:\n        # Schema for the `parameters` field\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls usage of the host filesystem. Corresponds to the\n            `allowedHostPaths` field in a PodSecurityPolicy. For more information,\n            see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#volumes-and-file-systems\n          properties:\n            allowedHostPaths:\n              type: array\n              description: \"An array of hostpath objects, representing paths and read/write configuration.\"\n              items:\n                type: object\n                properties:\n                  pathPrefix:\n                    type: string\n                    description: \"The path prefix that the host volume must match.\"\n                  readOnly:\n                    type: boolean\n                    description: \"when set to true, any container volumeMounts matching the pathPrefix must include `readOnly: true`.\"\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spsphostfilesystem\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            volume := input_hostpath_volumes[_]\n            allowedPaths := get_allowed_paths(input)\n            input_hostpath_violation(allowedPaths, volume)\n            msg := sprintf(\"HostPath volume %v is not allowed, pod: %v. Allowed path: %v\", [volume, input.review.object.metadata.name, allowedPaths])\n        }\n\n        input_hostpath_violation(allowedPaths, volume) {\n            # An empty list means all host paths are blocked\n 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/build-kyma-artifacts\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-kyma-gardener-gcp-eventing-upgrade\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-integration-gardener-eventing-upgrade\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # kyma-upgrade-gardener-kyma2-to-main-reconciler-main\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-upgrade-gardener-kyma2-to-main\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # kyma-upgrade-gardener-kyma2-minor-versions\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/kyma-upgrade-gardener-kyma2-minor-versions\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # github-issues\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/github-issues\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # pre-release-pr-image-guard\n      - image: \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/pr-image-guard\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # skr-aws-upgrade-integration-dev\n      - image: \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/cluster-integration\\/skr-aws-upgrade-integration-dev\\.sh\"\\],\"container_name\":\"test\",.*$'\n      # post-keda-manager-module-build\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\.\\/scripts\\/release.sh\",\"ci\"\\],\"container_name\":\"test\",.*$'\n      # post-telemetry-manager-release-module\n      - image: \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"make\",\"release\"\\],\"container_name\":\"test\",.*$'\n      # ci-prow-branchprotector\n      - image: \"gcr.io/k8s-prow/branchprotector:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"branchprotector\",\"--config-path=prow\\/config\\.yaml\",\"--job-config-path=prow\\/jobs\",\"--github-token-path=\\/etc\\/github\\/token\",\"--confirm\",\"--github-endpoint=http:\\/\\/ghproxy\",\"--github-endpoint=https:\\/\\/api\\.github\\.com\"\\],\"container_name\":\"test\",.*$'\n      # pull-hide-tf-github-comments\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/ghcomment\\/github-comment\",\"hide\",\"--org\",\"\\$\\(REPO_OWNER\\)\",\"--repo\",\"\\$\\(REPO_NAME\\)\",\"-pr\",\"\\$\\(PULL_NUMBER\\)\",\"-sha1\",\"\\$\\(PULL_PULL_SHA\\)\"\\],\"container_name\":\"test\",.*$'\n      # pre-main-check-users-map\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"usersmapchecker\"\\],\"container_name\":\"test\",.*$'\n      # pull-secret-leaks-log-scanner-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA\\nplan -- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner plan\\n-input=false; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # post-secret-leaks-log-scanner-tf-apply\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner apply -input=false\\n-auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-secrets-rotator-tf-plan\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod init -input=false\\n\\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER\\n-sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod\\nplan -input=false -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # jobname\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform\\n-chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026\\n\\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply\\n-- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false\\n-auto-approve  -var-file=\\.\\/terraform\\.tfvars; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*$'\n      # pull-plan-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod plan -input=false\\ -no-color; \\/ghcomment\\/github-comment hide --org \\$\\(REPO_OWNER\\) --repo \\$\\(REPO_NAME\\) -pr \\$\\(PULL_NUMBER\\) -sha1 \\$\\(PULL_PULL_SHA\\)\\\"\\],\"container_name\":\"test\",.*$'\n      # post-apply-prod-terraform\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false -no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$\\(REPO_OWNER\\) --repo \\$\\(REPO_NAME\\) -sha1 \\$\\(PULL_BASE_SHA\\)\"\\],\"container_name\":\"test\",.*$'\n      # sidecar\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/secrettrustedusages/kyma-bot-github-token]
module.untrusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: SecretTrustedUsage\nmetadata:\n  name: kyma-autobump-bot-github-token\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedSecrets:\n      - kyma-autobump-bot-github-token\n    trustedImages:\n      # Prowjob name: post-test-infra-markdown-index-autobump\n      - image: \"eu.gcr.io/kyma-project/test-infra/markdown-index:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/markdown-index\",\"--config=prow\\/markdown-index\\/test-infra-markdown-index-autobump-config\\.yaml\",\"--labels-override=kind\\/chore,area\\/documentation\"\\],\"container_name\":\"test\",.*}$'\n      # Prowjob name: test-infra-image-detector-autobump\n      # Prowjob name: post-test-infra-image-detector-autobump\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/image-detector:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/imagedetector\",\"--prow-config=prow\\/config\\.yaml\",\"--prow-jobs-dir=prow\\/jobs\",\"--terraform-dir=configs\\/terraform\",\"--sec-scanner-config=sec-scanners-config\\.yaml\",\"--kubernetes-dir=prow\\/cluster\\/components\",\"--autobump-config=prow\\/image-detector\\/test-infra-sec-config-autobump-config\\.yaml\",\"--inrepo-config=prow\\/image-detector\\/inrepo-config\\.yaml\"\\],\"container_name\":\"test\",.*}$'\n      # Prowjob name: eventing-tools-autobump\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"generic-autobumper\",\"--config=ci\\/eventing-tools-autobump-config\\.yaml\"\\],\"container_name\":\"test\",.*}$'\n      # Prowjob name: ci-prow-autobump\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"generic-autobumper\",\"--config=prow\\/autobump-config\\/prow-cluster-autobump-config\\.yaml\",\"--labels-override=kind\\/chore,area\\/prow\"\\],\"container_name\":\"test\",.*}$'\n      # Prowjob name: ci-prow-autobump-jobs\n      - image: \"gcr.io/k8s-prow/generic-autobumper:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"generic-autobumper\",\"--config=prow\\/autobump-config\\/test-infra-autobump-config\\.yaml\",\"--labels-override=skip-review,area\\/ci,kind\\/chore\"\\],\"container_name\":\"test\",.*}$'\n      # Prowjob name: ci-prow-label-sync\n      - image: \"gcr.io/k8s-prow/label_sync:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"label_sync\",\"--config=\\/etc\\/config\\/labels\\.yaml\",\"--confirm=true\",\"--orgs=kyma-project,kyma-incubator\",\"--token=\\/etc\\/github\\/token\",\"--endpoint=http:\\/\\/ghproxy\",\"--endpoint=https:\\/\\/api\\.github\\.com\",\"--debug\"\\],\"container_name\":\"test\",.*}$'\n      # sidecar\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/secrettrustedusages/kyma-autobump-bot-github-token]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_variable.gcp_terraform_executor_service_account_email will be created
  + resource "github_actions_variable" "gcp_terraform_executor_service_account_email" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "test-infra"
      + updated_at    = (known after apply)
      + value         = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
      + variable_name = "gcp_terraform_executor_service_account_email"
    }

  # github_actions_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider will be created
  + resource "github_actions_variable" "gh_com_kyma_project_gcp_workload_identity_federation_provider" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "test-infra"
      + updated_at    = (known after apply)
      + value         = (known after apply)
      + variable_name = "gh_com_kyma_project_gcp_workload_identity_federation_provider"
    }

  # module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool.main will be created
  + resource "google_iam_workload_identity_pool" "main" {
      + description               = "Workload Identity Pool managed by Terraform"
      + disabled                  = false
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "projects/\"sap-kyma-prow\"/regions/\"europe-west4\"/zones/<null>"
      + state                     = (known after apply)
      + workload_identity_pool_id = "github-com-kyma-project-pool"
    }

  # module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool_provider.main will be created
  + resource "google_iam_workload_identity_pool_provider" "main" {
      + attribute_mapping                  = {
          + "attribute.actor"               = "assertion.actor"
          + "attribute.aud"                 = "assertion.aud"
          + "attribute.event_name"          = "assertion.event_name"
          + "attribute.repository_id"       = "assertion.repository_id"
          + "attribute.repository_owner_id" = "assertion.repository_owner_id"
          + "attribute.workflow"            = "assertion.workflow"
          + "attribute.workflow_ref"        = "assertion.workflow_ref"
          + "google.subject"                = "\"repository_id:\" + assertion.repository_id + \":repository_owner_id:\" + assertion.repository_owner_id + \":workflow:\" + assertion.workflow"
        }
      + description                        = "Workload Identity Pool Provider managed by Terraform"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "projects/\"sap-kyma-prow\"/regions/\"europe-west4\"/zones/<null>"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "github-com-kyma-project-pool"
      + workload_identity_pool_provider_id = "github-com-kyma-project-provider"

      + oidc {
          + allowed_audiences = []
          + issuer_uri        = "https://token.actions.githubusercontent.com"
        }
    }

  # module.gh_com_kyma_project_workload_identity_federation.google_service_account_iam_member.wif-sa["terraform_executor_pull_prod_plan"] will be created
  + resource "google_service_account_iam_member" "wif-sa" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
github_actions_variable.gcp_terraform_executor_service_account_email: Creating...
module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool.main: Creating...

Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.trusted_workload_terraform_executor,
  on terraform-executor.tf line 42, in resource "kubernetes_service_account" "trusted_workload_terraform_executor":
  42: resource "kubernetes_service_account" "trusted_workload_terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and one more similar warning elsewhere)

Error: POST https://api.github.com/repos/kyma-project/test-infra/actions/variables: 409 Already exists - Variable already exists []

  with github_actions_variable.gcp_terraform_executor_service_account_email,
  on terraform-executor.tf line 70, in resource "github_actions_variable" "gcp_terraform_executor_service_account_email":
  70: resource "github_actions_variable" "gcp_terraform_executor_service_account_email" {


Error: Error creating WorkloadIdentityPool: googleapi: got HTTP response code 404 with body: <!DOCTYPE html>
<html lang=en>
  <meta charset=utf-8>
  <meta name=viewport content="initial-scale=1, minimum-scale=1, width=device-width">
  <title>Error 404 (Not Found)!!1</title>
  <style>
    *{margin:0;padding:0}html,code{font:15px/22px arial,sans-serif}html{background:#fff;color:#222;padding:15px}body{margin:7% auto 0;max-width:390px;min-height:180px;padding:30px 0 15px}* > body{background:url(//www.google.com/images/errors/robot.png) 100% 5px no-repeat;padding-right:205px}p{margin:11px 0 22px;overflow:hidden}ins{color:#777;text-decoration:none}a img{border:0}@media screen and (max-width:772px){body{background:none;margin-top:0;max-width:none;padding-right:0}}#logo{background:url(//www.google.com/images/branding/googlelogo/1x/googlelogo_color_150x54dp.png) no-repeat;margin-left:-5px}@media only screen and (min-resolution:192dpi){#logo{background:url(//www.google.com/images/branding/googlelogo/2x/googlelogo_color_150x54dp.png) no-repeat 0% 0%/100% 100%;-moz-border-image:url(//www.google.com/images/branding/googlelogo/2x/googlelogo_color_150x54dp.png) 0}}@media only screen and (-webkit-min-device-pixel-ratio:2){#logo{background:url(//www.google.com/images/branding/googlelogo/2x/googlelogo_color_150x54dp.png) no-repeat;-webkit-background-size:100% 100%}}#logo{display:inline-block;height:54px;width:150px}
  </style>
  <a href=//www.google.com/><span id=logo aria-label=Google></span></a>
  <p><b>404.</b> <ins>That’s an error.</ins>
  <p>The requested URL <code>/v1beta/projects/projects/%22sap-kyma-prow%22/regions/%22europe-west4%22/zones/%3Cnull%3E/locations/global/workloadIdentityPools?alt=json&amp;workloadIdentityPoolId=github-com-kyma-project-pool</code> was not found on this server.  <ins>That’s all we know.</ins>


  with module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool.main,
  on .terraform/modules/gh_com_kyma_project_workload_identity_federation/modules/gh-oidc/main.tf line 17, in resource "google_iam_workload_identity_pool" "main":
  17: resource "google_iam_workload_identity_pool" "main" {


```

</details>

`

<!-- github-comment: {"Command":"apply","PRNumber":8336,"Program":"tfcmt","SHA1":"67058e2dd4ac64cace2ea2b0b78e19dd0e35ba08","Vars":{}} -->